backend/app/app/tests/crud/_utils/cassettes/TestStripe.test_create_checkout_session.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      User-Agent:
      - Stripe/v1 PythonBindings/2.60.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_tg6XEQ215Jpbnq", "request_duration_ms":
        1}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.60.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.2", "platform": "Linux-5.10.49-1-MANJARO-x86_64-with-glibc2.2.5",
        "uname": "Linux aa5c70fc2c12 5.10.49-1-MANJARO #1 SMP PREEMPT Sun Jul 11 12:59:43
        UTC 2021 x86_64 "}'
      authorization:
      - DUMMY
    method: GET
    uri: https://api.stripe.com/v1/prices?lookup_keys%5B0%5D=no_plan&lookup_keys%5B1%5D=free&lookup_keys%5B2%5D=lite&lookup_keys%5B3%5D=medium&lookup_keys%5B4%5D=enterprise&lookup_keys%5B5%5D=cancelled
  response:
    body:
      string: "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"price_1JFnKrISAshlKrRgdPcdclQ9\",\n
        \     \"object\": \"price\",\n      \"active\": true,\n      \"billing_scheme\":
        \"per_unit\",\n      \"created\": 1626904333,\n      \"currency\": \"eur\",\n
        \     \"livemode\": false,\n      \"lookup_key\": \"enterprise\",\n      \"metadata\":
        {\n      },\n      \"nickname\": null,\n      \"product\": \"prod_JtaVPrC8nroNHr\",\n
        \     \"recurring\": {\n        \"aggregate_usage\": null,\n        \"interval\":
        \"month\",\n        \"interval_count\": 1,\n        \"trial_period_days\":
        null,\n        \"usage_type\": \"licensed\"\n      },\n      \"tiers_mode\":
        null,\n      \"transform_quantity\": null,\n      \"type\": \"recurring\",\n
        \     \"unit_amount\": 4900,\n      \"unit_amount_decimal\": \"4900\"\n    },\n
        \   {\n      \"id\": \"price_1JFnKPISAshlKrRgQ3RTCFiO\",\n      \"object\":
        \"price\",\n      \"active\": true,\n      \"billing_scheme\": \"per_unit\",\n
        \     \"created\": 1626904305,\n      \"currency\": \"eur\",\n      \"livemode\":
        false,\n      \"lookup_key\": \"lite\",\n      \"metadata\": {\n      },\n
        \     \"nickname\": null,\n      \"product\": \"prod_JtaVoLzg2hQ3rf\",\n      \"recurring\":
        {\n        \"aggregate_usage\": null,\n        \"interval\": \"month\",\n
        \       \"interval_count\": 1,\n        \"trial_period_days\": null,\n        \"usage_type\":
        \"licensed\"\n      },\n      \"tiers_mode\": null,\n      \"transform_quantity\":
        null,\n      \"type\": \"recurring\",\n      \"unit_amount\": 500,\n      \"unit_amount_decimal\":
        \"500\"\n    },\n    {\n      \"id\": \"price_1JFnKfISAshlKrRgGSXXMHHy\",\n
        \     \"object\": \"price\",\n      \"active\": true,\n      \"billing_scheme\":
        \"per_unit\",\n      \"created\": 1626904321,\n      \"currency\": \"eur\",\n
        \     \"livemode\": false,\n      \"lookup_key\": \"medium\",\n      \"metadata\":
        {\n      },\n      \"nickname\": null,\n      \"product\": \"prod_JtaVCSClv3JOfb\",\n
        \     \"recurring\": {\n        \"aggregate_usage\": null,\n        \"interval\":
        \"month\",\n        \"interval_count\": 1,\n        \"trial_period_days\":
        null,\n        \"usage_type\": \"licensed\"\n      },\n      \"tiers_mode\":
        null,\n      \"transform_quantity\": null,\n      \"type\": \"recurring\",\n
        \     \"unit_amount\": 1900,\n      \"unit_amount_decimal\": \"1900\"\n    }\n
        \ ],\n  \"has_more\": false,\n  \"url\": \"/v1/prices\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '2132'
      Content-Type:
      - application/json
      Date:
      - Sun, 25 Jul 2021 11:52:48 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_ZnmNQPHWI7Y6oV
      stripe-version:
      - '2020-08-27'
      x-stripe-c-cost:
      - '0'
    status:
      code: 200
      message: OK
- request:
    body: success_url=http%3A%2F%2Flocalhost%2Fmain%2Ftransaction%2Fsuccess&cancel_url=http%3A%2F%2Flocalhost%2Fmain%2Ftransaction%2Fcancelled&customer=cus_JuvfQtesBmJXnQ&payment_method_types[0]=card&mode=subscription&metadata[plan]=lite&line_items[0][price]=price_1JFnKPISAshlKrRgQ3RTCFiO&line_items[0][quantity]=1&subscription_data[trial_period_days]=14
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '345'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 23a91669-3b9a-4752-83af-d9e3c45f36de
      User-Agent:
      - Stripe/v1 PythonBindings/2.60.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_ZnmNQPHWI7Y6oV", "request_duration_ms":
        623}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.60.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.2", "platform": "Linux-5.10.49-1-MANJARO-x86_64-with-glibc2.2.5",
        "uname": "Linux aa5c70fc2c12 5.10.49-1-MANJARO #1 SMP PREEMPT Sun Jul 11 12:59:43
        UTC 2021 x86_64 "}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/checkout/sessions
  response:
    body:
      string: "{\n  \"id\": \"cs_test_a1ZSrlAkflROcu5MN2h0t5dgDQUILlQVxoFjpAhjd9gyRlKGFgsyADq8Ou\",\n
        \ \"object\": \"checkout.session\",\n  \"allow_promotion_codes\": null,\n
        \ \"amount_subtotal\": 0,\n  \"amount_total\": 0,\n  \"automatic_tax\": {\n
        \   \"enabled\": false,\n    \"status\": null\n  },\n  \"billing_address_collection\":
        null,\n  \"cancel_url\": \"http://localhost/main/transaction/cancelled\",\n
        \ \"client_reference_id\": null,\n  \"currency\": \"eur\",\n  \"customer\":
        \"cus_JuvfQtesBmJXnQ\",\n  \"customer_details\": null,\n  \"customer_email\":
        null,\n  \"livemode\": false,\n  \"locale\": null,\n  \"metadata\": {\n    \"plan\":
        \"lite\"\n  },\n  \"mode\": \"subscription\",\n  \"payment_intent\": null,\n
        \ \"payment_method_options\": null,\n  \"payment_method_types\": [\n    \"card\"\n
        \ ],\n  \"payment_status\": \"unpaid\",\n  \"setup_intent\": null,\n  \"shipping\":
        null,\n  \"shipping_address_collection\": null,\n  \"submit_type\": null,\n
        \ \"subscription\": null,\n  \"success_url\": \"http://localhost/main/transaction/success\",\n
        \ \"total_details\": {\n    \"amount_discount\": 0,\n    \"amount_shipping\":
        0,\n    \"amount_tax\": 0\n  },\n  \"url\": \"https://checkout.stripe.com/pay/cs_test_a1ZSrlAkflROcu5MN2h0t5dgDQUILlQVxoFjpAhjd9gyRlKGFgsyADq8Ou#fidkdWxOYHwnPyd1blpxYHZxWjA0TGZ8b2ZMVkR2bWlOd1diXTJLYTcycUFQfTY9S1JRVmd2dERscFBCbG9XTnY9NUs9Sj1vY01ESExiaVZHdTNMc25nUXI1b19Ob3E0Nl0yMjF9dkNQNWQyNTVtUU1DUkNUNScpJ2N3amhWYHdzYHcnP3F3cGApJ2lkfGpwcVF8dWAnPyd2bGtiaWBabHFgaCcpJ2BrZGdpYFVpZGZgbWppYWB3dic%2FcXdwYHgl\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1400'
      Content-Type:
      - application/json
      Date:
      - Sun, 25 Jul 2021 11:52:48 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - 23a91669-3b9a-4752-83af-d9e3c45f36de
      original-request:
      - req_B7nqxv8MD6UvYP
      request-id:
      - req_B7nqxv8MD6UvYP
      stripe-should-retry:
      - 'false'
      stripe-version:
      - '2020-08-27'
      x-stripe-c-cost:
      - '1'
    status:
      code: 200
      message: OK
version: 1
